{
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "classifier_dropout": 0.1,
  "dtype": "float16",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout": 0.0,
  "hidden_size": 3072,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_attention_heads": 24,
  "num_hidden_layers": 32,
  "partial_rotary_factor": 0.5,
  "rope_scaling": null,
  "rope_theta": 10000,
  "rotary_emb_base": 10000,
  "rotary_pct": 0.5,
  "tie_word_embeddings": false,
  "transformers_version": "4.56.0",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 30080
}
